# list

num_list = [1, 2, 3, 4, 5]

#=================================

# append

num_list.append(6)

'''
[1, 2, 3, 4, 5, 6]
'''

#=================================

# insert

num_list.insert(4, 1) # (주소, 넣을 값)

'''
[1, 2, 3, 4, 1, 5]
'''

#================================

# extend
# iterable 객체 삽입

num_list.extend([1, 2, 3])

'''
[1, 2, 3, 4, 5, 1, 2, 3]
'''

#------------------------------------------------------------------------------------------

list1 = [11, 12, 43, 4, 6]


# remove
# 값 받아 삭제

for i in list1.copy():
    if not i%2:
        list1.remove(i)

print(list1)


'''
[11, 43]
'''

#================================

# del
# 인덱스 받아 삭제

del list1[0]
print(list1)


'''
[12, 43, 4, 6]
'''

#================================

# pop
# 마지막 값 삭제

list1.pop()
print(list1)


'''
[11, 12, 43, 4]
'''

#------------------------------------------------------------------------------------------

# set
# 중복 제거 가능

li = [120, 120, 10, 20, 30, 20]

new_li = []
new_set = set()

for item in li:
    if item not in new_set: # set에 없다면 추가
        new_set.add(item)
        new_li.append(item)
        
new_li


'''
[120, 10, 20, 30]
'''

#------------------------------------------------------------------------------------------

# dictionary
#

dic = {}

string = 'e21eqwe123'

for s in string:
    dic[s] = dic.get(s, 0) + 1 # 문자마다 밸류 연산(등장횟수 카운트)

print('\n'.join(['%s, %s' % (k,v) for k, v in dic.items()]))


'''
e, 3
2, 2
1, 2
q, 1
w, 1
3, 1
'''