import re

#-------------------------------------------------------------------------------------------


# .
# 임의 문자 한 개

wordlist = ['color', 'colour', 'work']

for word in wordlist:
    if re.search('col..r', word): # .. : 임의 문자 두개
        print(word)


'''
colour
'''

#-------------------------------------------------------------------------------------------


# match
# 조건에 맞는 문자 검색

expression = '<html><head><title><Title></title>'

print(re.match('<.*>', expression).span()) # span : 포함 범위
print(re.match('<.*>', expression).group()) # group : 포함 문자


'''
(0, 34)
<html><head><title><Title></title>
'''

#-------------------------------------------------------------------------------------------


# compile
# 검색 형식 지정

phone = re.compile("""  # 정규표현식 처리 형식 지정
010-    # 앞자리
\d{4}-  # 중간
\d{4}   # 끝자리
""", re.VERBOSE # 정규표현식 내부 주석 표시
)

info = ['김 010-1234-1234', '이 010-5678-5678']

for text in info:
    match_object = phone.search(text)
    print(match_object.group())


'''
010-1234-1234
010-5678-5678
'''

#-------------------------------------------------------------------------------------------


# 이스케이프 문자

print('abc\nabc') # 줄넘김
print('123\t123') # 탭
print('         \rdef') # 시작위치 정렬
print('1234\b') # 백스페이스
print('\\')     # 백슬래시 출력
print('\'\"')   # 따옴표 출력


'''
abc
abc
123	123
def      
123
\
'"
'''

#-------------------------------------------------------------------------------------------


# raw string
# 문자열을 그대로 사용할 때

print('raw string 사용용\b')
print(r'raw string 사용용\b')

'''
raw string 사용
raw string 사용용\b
'''

#-------------------------------------------------------------------------------------------